RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/inc/msp432e401y.h
/******************************************************************************
* Definition of standard bits                                                 *
******************************************************************************/
#define BIT0                                     (uint16_t)(0x0001)
#define BIT1                                     (uint16_t)(0x0002)
#define BIT2                                     (uint16_t)(0x0004)
#define BIT3                                     (uint16_t)(0x0008)
#define BIT4                                     (uint16_t)(0x0010)
#define BIT5                                     (uint16_t)(0x0020)
#define BIT6                                     (uint16_t)(0x0040)
#define BIT7                                     (uint16_t)(0x0080)
#define BIT8                                     (uint16_t)(0x0100)
#define BIT9                                     (uint16_t)(0x0200)
#define BITA                                     (uint16_t)(0x0400)
#define BITB                                     (uint16_t)(0x0800)
#define BITC                                     (uint16_t)(0x1000)
#define BITD                                     (uint16_t)(0x2000)
#define BITE                                     (uint16_t)(0x4000)
#define BITF                                     (uint16_t)(0x8000)
#define BIT(x)                                 ((uint16_t)1 << (x))

/* ================================================================================ */
/* ================              Available Peripherals             ================ */
/* ================================================================================ */
#define __MCU_HAS_ADC0__                            /*!< Module ADC0 is available                                              */
#define __MCU_HAS_ADC1__                            /*!< Module ADC1 is available                                              */
#define __MCU_HAS_AES0__                            /*!< Module AES is available                                               */
#define __MCU_HAS_CAN0__                            /*!< Module CAN 0 is available                                             */
#define __MCU_HAS_CAN1__                            /*!< Module CAN 1 is available                                             */
#define __MCU_HAS_CCM0__                            /*!< Module EC is available                                                */
#define __MCU_HAS_COMP0__                           /*!< Module Analog Comparator 0 is available                               */
#define __MCU_HAS_COMP1__                           /*!< Module Analog Comparator 1 is available                               */
#define __MCU_HAS_COMP2__                           /*!< Module Analog Comparator 2 is available                               */
#define __MCU_HAS_DES0__                            /*!< Module DES is available                                               */
#define __MCU_HAS_EEPROM__                          /*!< Module EEPROM is available                                            */
#define __MCU_HAS_EMAC0__                           /*!< Module Ethernet MAC 0 is available                                    */
#define __MCU_HAS_EPI0__                            /*!< Module EPI 0 is available                                             */
#define __MCU_HAS_FLASH_CTRL__                      /*!< Module Flash Memory Control is available                              */
#define __MCU_HAS_GPIOA__                           /*!< Module GPIO Port A is available                                       */
#define __MCU_HAS_GPIOB__                           /*!< Module GPIO Port A is available                                       */
#define __MCU_HAS_GPIOC__                           /*!< Module GPIO Port C is available                                       */
#define __MCU_HAS_GPIOD__                           /*!< Module GPIO Port D is available                                       */
#define __MCU_HAS_GPIOE__                           /*!< Module GPIO Port E is available                                       */
#define __MCU_HAS_GPIOF__                           /*!< Module GPIO Port F is available                                       */
#define __MCU_HAS_GPIOG__                           /*!< Module GPIO Port G is available                                       */
#define __MCU_HAS_GPIOH__                           /*!< Module GPIO Port H is available                                       */
#define __MCU_HAS_GPIOJ__                           /*!< Module GPIO Port J is available                                       */
#define __MCU_HAS_GPIOK__                           /*!< Module GPIO Port K is available                                       */
#define __MCU_HAS_GPIOL__                           /*!< Module GPIO Port L is available                                       */
#define __MCU_HAS_GPIOM__                           /*!< Module GPIO Port M is available                                       */
#define __MCU_HAS_GPION__                           /*!< Module GPIO Port N is available                                       */
#define __MCU_HAS_GPIOP__                           /*!< Module GPIO Port P is available                                       */
#define __MCU_HAS_GPIOQ__                           /*!< Module GPIO Port Q is available                                       */
#define __MCU_HAS_HIBERNATE__                       /*!< Module HIB is available                                               */
#define __MCU_HAS_I2C0__                            /*!< Module I2C0 is available                                              */
#define __MCU_HAS_I2C1__                            /*!< Module I2C1 is available                                              */
#define __MCU_HAS_I2C2__                            /*!< Module I2C2 is available                                              */
#define __MCU_HAS_I2C3__                            /*!< Module I2C3 is available                                              */
#define __MCU_HAS_I2C4__                            /*!< Module I2C4 is available                                              */
#define __MCU_HAS_I2C5__                            /*!< Module I2C5 is available                                              */
#define __MCU_HAS_I2C6__                            /*!< Module I2C6 is available                                              */
#define __MCU_HAS_I2C7__                            /*!< Module I2C7 is available                                              */
#define __MCU_HAS_I2C8__                            /*!< Module I2C8 is available                                              */
#define __MCU_HAS_I2C9__                            /*!< Module I2C9 is available                                              */
#define __MCU_HAS_PWM0__                            /*!< Module PWM0 is available                                              */
#define __MCU_HAS_QEI0__                            /*!< Module QEI0 is available                                              */
#define __MCU_HAS_SHA0__                            /*!< Module SHA/MD5 is available                                           */
#define __MCU_HAS_SSI0__                            /*!< Module SSI0 is available                                              */
#define __MCU_HAS_SSI1__                            /*!< Module SSI1 is available                                              */
#define __MCU_HAS_SSI2__                            /*!< Module SSI2 is available                                              */
#define __MCU_HAS_SSI3__                            /*!< Module SSI3 is available                                              */
#define __MCU_HAS_SYSCTL__                          /*!< Module System Control is available                                    */
#define __MCU_HAS_SYSEXC__                          /*!< Module Floating-Point Exception is available                          */
#define __MCU_HAS_TEMPER0__                         /*!< Module Temper is available                                            */
#define __MCU_HAS_TIMER0A__                         /*!< Module 16/32-Bit Timer 0A is available                                */
#define __MCU_HAS_TIMER0B__                         /*!< Module 16/32-Bit Timer 0B is available                                */
#define __MCU_HAS_TIMER1A__                         /*!< Module 16/32-Bit Timer 1A is available                                */
#define __MCU_HAS_TIMER1B__                         /*!< Module 16/32-Bit Timer 1B is available                                */
#define __MCU_HAS_TIMER2A__                         /*!< Module 16/32-Bit Timer 2A is available                                */
#define __MCU_HAS_TIMER2B__                         /*!< Module 16/32-Bit Timer 2B is available                                */
#define __MCU_HAS_TIMER3A__                         /*!< Module 16/32-Bit Timer 3A is available                                */
#define __MCU_HAS_TIMER3B__                         /*!< Module 16/32-Bit Timer 3B is available                                */
#define __MCU_HAS_TIMER4A__                         /*!< Module 16/32-Bit Timer 4A is available                                */
#define __MCU_HAS_TIMER4B__                         /*!< Module 16/32-Bit Timer 4B is available                                */
#define __MCU_HAS_TIMER5A__                         /*!< Module 16/32-Bit Timer 5A is available                                */
#define __MCU_HAS_TIMER5B__                         /*!< Module 16/32-Bit Timer 5B is available                                */
#define __MCU_HAS_TIMER6A__                         /*!< Module 16/32-Bit Timer 6A is available                                */
#define __MCU_HAS_TIMER6B__                         /*!< Module 16/32-Bit Timer 6B is available                                */
#define __MCU_HAS_TIMER7A__                         /*!< Module 16/32-Bit Timer 7A is available                                */
#define __MCU_HAS_TIMER7B__                         /*!< Module 16/32-Bit Timer 7B is available                                */
#define __MCU_HAS_UART0__                           /*!< Module UART0 is available                                             */
#define __MCU_HAS_UART1__                           /*!< Module UART1 is available                                             */
#define __MCU_HAS_UART2__                           /*!< Module UART2 is available                                             */
#define __MCU_HAS_UART3__                           /*!< Module UART3 is available                                             */
#define __MCU_HAS_UART4__                           /*!< Module UART4 is available                                             */
#define __MCU_HAS_UART5__                           /*!< Module UART5 is available                                             */
#define __MCU_HAS_UART6__                           /*!< Module UART6 is available                                             */
#define __MCU_HAS_UART7__                           /*!< Module UART7 is available                                             */
#define __MCU_HAS_UDMA__                            /*!< Module uDMA 0 Software is available                                   */
#define __MCU_HAS_USB0__                            /*!< Module USB MAC is available                                           */
#define __MCU_HAS_WATCHDOG0__                       /*!< Module Watchdog Timer 0 is available                                  */
#define __MCU_HAS_WATCHDOG1__                       /*!< Module Watchdog Timer 1 is available                                  */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                    WATCHDOG0                   ================ */
/* ================================================================================ */


/**
  * @brief Register map for WATCHDOG0 peripheral (WATCHDOG0)
  */

