RT-Thread/rt-thread/bsp/msp432e401y-LaunchPad/libraries/msp432e4/inc/msp432e401y.h
typedef struct {                                    /*!< DES Structure                                                         */
  __IO uint32_t  KEY3_L;                            /*!< DES Key 3 LSW for 192-Bit Key                                         */
  __IO uint32_t  KEY3_H;                            /*!< DES Key 3 MSW for 192-Bit Key                                         */
  __IO uint32_t  KEY2_L;                            /*!< DES Key 2 LSW for 128-Bit Key                                         */
  __IO uint32_t  KEY2_H;                            /*!< DES Key 2 MSW for 128-Bit Key                                         */
  __IO uint32_t  KEY1_L;                            /*!< DES Key 1 LSW for 64-Bit Key                                          */
  __IO uint32_t  KEY1_H;                            /*!< DES Key 1 MSW for 64-Bit Key                                          */
  __IO uint32_t  IV_L;                              /*!< DES Initialization Vector                                             */
  __IO uint32_t  IV_H;                              /*!< DES Initialization Vector                                             */
  __IO uint32_t  CTRL;                              /*!< DES Control                                                           */
  __IO uint32_t  LENGTH;                            /*!< DES Cryptographic Data Length                                         */
  __IO uint32_t  DATA_L;                            /*!< DES LSW Data RW                                                       */
  __IO uint32_t  DATA_H;                            /*!< DES MSW Data RW                                                       */
  __IO uint32_t  REVISION;                          /*!< DES Revision Number                                                   */
  __IO uint32_t  SYSCONFIG;                         /*!< DES System Configuration                                              */
  __IO uint32_t  SYSSTATUS;                         /*!< DES System Status                                                     */
  __IO uint32_t  IRQSTATUS;                         /*!< DES Interrupt Status                                                  */
  __IO uint32_t  IRQENABLE;                         /*!< DES Interrupt Enable                                                  */
  __IO uint32_t  DIRTYBITS;                         /*!< DES Dirty Bits                                                        */
} DES_Type;

typedef struct {
  __IO uint32_t  DMAIM;                             /*!< DES DMA Interrupt Mask                                                */
  __IO uint32_t  DMARIS;                            /*!< DES DMA Raw Interrupt Status                                          */
  __IO uint32_t  DMAMIS;                            /*!< DES DMA Masked Interrupt Status                                       */
  __IO uint32_t  DMAIC;                             /*!< DES DMA Interrupt Clear                                               */
} DES_DMA_Type;



/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define FLASH_BASE                      ((uint32_t)0x00000000)
#define SRAM_BASE                       ((uint32_t)0x20000000)
#define WATCHDOG0_BASE                  ((uint32_t)0x40000000)
#define WATCHDOG1_BASE                  ((uint32_t)0x40001000)
#define SSI0_BASE                       ((uint32_t)0x40008000)
#define SSI1_BASE                       ((uint32_t)0x40009000)
#define SSI2_BASE                       ((uint32_t)0x4000A000)
#define SSI3_BASE                       ((uint32_t)0x4000B000)
#define UART0_BASE                      ((uint32_t)0x4000C000)
#define UART1_BASE                      ((uint32_t)0x4000D000)
#define UART2_BASE                      ((uint32_t)0x4000E000)
#define UART3_BASE                      ((uint32_t)0x4000F000)
#define UART4_BASE                      ((uint32_t)0x40010000)
#define UART5_BASE                      ((uint32_t)0x40011000)
#define UART6_BASE                      ((uint32_t)0x40012000)
#define UART7_BASE                      ((uint32_t)0x40013000)
#define I2C0_BASE                       ((uint32_t)0x40020000)
#define I2C1_BASE                       ((uint32_t)0x40021000)
#define I2C2_BASE                       ((uint32_t)0x40022000)
#define I2C3_BASE                       ((uint32_t)0x40023000)
#define PWM0_BASE                       ((uint32_t)0x40028000)
#define QEI0_BASE                       ((uint32_t)0x4002C000)
#define TIMER0_BASE                     ((uint32_t)0x40030000)
#define TIMER1_BASE                     ((uint32_t)0x40031000)
#define TIMER2_BASE                     ((uint32_t)0x40032000)
#define TIMER3_BASE                     ((uint32_t)0x40033000)
#define TIMER4_BASE                     ((uint32_t)0x40034000)
#define TIMER5_BASE                     ((uint32_t)0x40035000)
#define ADC0_BASE                       ((uint32_t)0x40038000)
#define ADC1_BASE                       ((uint32_t)0x40039000)
#define COMP_BASE                       ((uint32_t)0x4003C000)
#define CAN0_BASE                       ((uint32_t)0x40040000)
#define CAN1_BASE                       ((uint32_t)0x40041000)
#define USB0_BASE                       ((uint32_t)0x40050000)
#define GPIO_PORTA_BASE                 ((uint32_t)0x40058000)
#define GPIO_PORTB_BASE                 ((uint32_t)0x40059000)
#define GPIO_PORTC_BASE                 ((uint32_t)0x4005A000)
#define GPIO_PORTD_BASE                 ((uint32_t)0x4005B000)
#define GPIO_PORTE_BASE                 ((uint32_t)0x4005C000)
#define GPIO_PORTF_BASE                 ((uint32_t)0x4005D000)
#define GPIO_PORTG_BASE                 ((uint32_t)0x4005E000)
#define GPIO_PORTH_BASE                 ((uint32_t)0x4005F000)
#define GPIO_PORTJ_BASE                 ((uint32_t)0x40060000)
#define GPIO_PORTK_BASE                 ((uint32_t)0x40061000)
#define GPIO_PORTL_BASE                 ((uint32_t)0x40062000)
#define GPIO_PORTM_BASE                 ((uint32_t)0x40063000)
#define GPIO_PORTN_BASE                 ((uint32_t)0x40064000)
#define GPIO_PORTP_BASE                 ((uint32_t)0x40065000)
#define GPIO_PORTQ_BASE                 ((uint32_t)0x40066000)
#define EEPROM_BASE                     ((uint32_t)0x400AF000)
#define I2C8_BASE                       ((uint32_t)0x400B8000)
#define I2C9_BASE                       ((uint32_t)0x400B9000)
#define I2C4_BASE                       ((uint32_t)0x400C0000)
#define I2C5_BASE                       ((uint32_t)0x400C1000)
#define I2C6_BASE                       ((uint32_t)0x400C2000)
#define I2C7_BASE                       ((uint32_t)0x400C3000)
#define EPI0_BASE                       ((uint32_t)0x400D0000)
#define TIMER6_BASE                     ((uint32_t)0x400E0000)
#define TIMER7_BASE                     ((uint32_t)0x400E1000)
#define EMAC0_BASE                      ((uint32_t)0x400EC000)
#define SYSEXC_BASE                     ((uint32_t)0x400F9000)
#define HIB_BASE                        ((uint32_t)0x400FC000)
#define FLASH_CTRL_BASE                 ((uint32_t)0x400FD000)
#define SYSCTL_BASE                     ((uint32_t)0x400FE000)
#define UDMA_BASE                       ((uint32_t)0x400FF000)
#define CCM0_BASE                       ((uint32_t)0x44030000)
#define CRC_BASE                        (CCM0_BASE+0x00000400)
#define SHAMD5_BASE                     ((uint32_t)0x44034000)
#define SHAMD5_DMA_BASE                 (CCM0_BASE+0x00000010)
#define AES_BASE                        ((uint32_t)0x44036000)
#define AES_DMA_BASE                    (CCM0_BASE+0x00000020)
#define DES_BASE                        ((uint32_t)0x44038000)
#define DES_DMA_BASE                    (CCM0_BASE+0x00000030)


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

